Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateElementInView Property
 Can't create this kind of element in this view in the current mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateElementInView { get; }
Public Shared ReadOnly Property CannotCreateElementInView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateElementInView {
	FailureDefinitionId^ get ();
}
static member CannotCreateElementInView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace